
## Plan Result (repository)

[CI link](https://github.com/tqer39/terraform-github/actions/runs/13910836656)


<pre><code>Plan: 4 to add, 7 to change, 0 to destroy.</code></pre>

* Create
  * module.openai_generate_pr_description.github_actions_repository_permissions.this
  * module.openai_generate_pr_description.github_branch_default.this
  * module.openai_generate_pr_description.github_branch_protection.this[&#34;main&#34;]
  * module.openai_generate_pr_description.github_repository.this
* Update
  * module.blog.github_repository.this
  * module.renovate_config.github_repository.this
  * module.terraform_aws.github_repository.this
  * module.terraform_github.github_repository.this
  * module.terraform_vercel.github_repository.this
  * module.time_capsule.github_repository.this
  * module.tqer39.github_repository.this


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.blog.github_repository.this will be updated in-place
  ~ resource "github_repository" "this" {
      ~ allow_auto_merge            = false -> true
      ~ allow_merge_commit          = false -> true
      ~ allow_rebase_merge          = false -> true
      ~ allow_squash_merge          = false -> true
      ~ allow_update_branch         = false -> true
      ~ delete_branch_on_merge      = false -> true
        id                          = "blog"
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
        name                        = "blog"
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      ~ topics                      = [
          - "managed-by-terraform-github",
            # (1 unchanged element hidden)
        ]
      ~ vulnerability_alerts        = false -> true
        # (24 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.openai_generate_pr_description.github_actions_repository_permissions.this will be created
  + resource "github_actions_repository_permissions" "this" {
      + allowed_actions = "all"
      + enabled         = true
      + id              = (known after apply)
      + repository      = "openai-generate-pr-description"
    }

  # module.openai_generate_pr_description.github_branch_default.this will be created
  + resource "github_branch_default" "this" {
      + branch     = "main"
      + etag       = (known after apply)
      + id         = (known after apply)
      + rename     = false
      + repository = "openai-generate-pr-description"
    }

  # module.openai_generate_pr_description.github_branch_protection.this["main"] will be created
  + resource "github_branch_protection" "this" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = "openai-generate-pr-description"
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = true

      + required_pull_request_reviews {
          + dismiss_stale_reviews           = false
          + require_code_owner_reviews      = false
          + require_last_push_approval      = false
          + required_approving_review_count = 1
          + restrict_dismissals             = false
        }

      + required_status_checks {
          + contexts = [
              + "pre-commit",
            ]
          + strict   = true
        }
    }

  # module.openai_generate_pr_description.github_repository.this will be created
  + resource "github_repository" "this" {
      + allow_auto_merge            = true
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + allow_update_branch         = true
      + archived                    = false
      + auto_init                   = true
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "Generate Pull Request description with OpenAI."
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = true
      + has_projects                = false
      + has_wiki                    = false
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "openai-generate-pr-description"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = [
          + "openai",
        ]
      + visibility                  = "public"
      + vulnerability_alerts        = true
      + web_commit_signoff_required = false

      + security_and_analysis (known after apply)
    }

  # module.renovate_config.github_repository.this will be updated in-place
  ~ resource "github_repository" "this" {
      ~ allow_auto_merge            = false -> true
      ~ allow_merge_commit          = false -> true
      ~ allow_rebase_merge          = false -> true
      ~ allow_squash_merge          = false -> true
      ~ allow_update_branch         = false -> true
      ~ delete_branch_on_merge      = false -> true
        id                          = "renovate-config"
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
        name                        = "renovate-config"
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      ~ topics                      = [
          - "managed-by-terraform-github",
            # (1 unchanged element hidden)
        ]
      ~ vulnerability_alerts        = false -> true
        # (24 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.terraform_aws.github_repository.this will be updated in-place
  ~ resource "github_repository" "this" {
      ~ allow_auto_merge            = false -> true
      ~ allow_merge_commit          = false -> true
      ~ allow_rebase_merge          = false -> true
      ~ allow_squash_merge          = false -> true
      ~ allow_update_branch         = false -> true
      ~ delete_branch_on_merge      = false -> true
        id                          = "terraform-aws"
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
        name                        = "terraform-aws"
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      ~ topics                      = [
          - "managed-by-terraform-github",
          + "terraform",
            # (1 unchanged element hidden)
        ]
      ~ vulnerability_alerts        = false -> true
        # (24 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.terraform_github.github_repository.this will be updated in-place
  ~ resource "github_repository" "this" {
      ~ allow_auto_merge            = false -> true
      ~ allow_merge_commit          = false -> true
      ~ allow_rebase_merge          = false -> true
      ~ allow_squash_merge          = false -> true
      ~ allow_update_branch         = false -> true
      ~ delete_branch_on_merge      = false -> true
        id                          = "terraform-github"
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
        name                        = "terraform-github"
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      ~ topics                      = [
          - "managed-by-terraform-github",
          + "terraform",
            # (1 unchanged element hidden)
        ]
      ~ vulnerability_alerts        = false -> true
        # (24 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.terraform_vercel.github_repository.this will be updated in-place
  ~ resource "github_repository" "this" {
      ~ allow_auto_merge            = false -> true
      ~ allow_merge_commit          = false -> true
      ~ allow_rebase_merge          = false -> true
      ~ allow_squash_merge          = false -> true
      ~ allow_update_branch         = false -> true
      ~ delete_branch_on_merge      = false -> true
        id                          = "terraform-vercel"
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
        name                        = "terraform-vercel"
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      ~ topics                      = [
          - "managed-by-terraform-github",
          + "terraform",
            # (1 unchanged element hidden)
        ]
      ~ vulnerability_alerts        = false -> true
        # (24 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.time_capsule.github_repository.this will be updated in-place
  ~ resource "github_repository" "this" {
      ~ allow_auto_merge            = false -> true
      ~ allow_merge_commit          = false -> true
      ~ allow_rebase_merge          = false -> true
      ~ allow_squash_merge          = false -> true
      ~ allow_update_branch         = false -> true
      ~ delete_branch_on_merge      = false -> true
        id                          = "time-capsule"
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
        name                        = "time-capsule"
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      ~ topics                      = [
          - "managed-by-terraform-github",
            # (2 unchanged elements hidden)
        ]
      ~ vulnerability_alerts        = false -> true
        # (24 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.tqer39.github_repository.this will be updated in-place
  ~ resource "github_repository" "this" {
      ~ allow_auto_merge            = false -> true
      ~ allow_merge_commit          = false -> true
      ~ allow_rebase_merge          = false -> true
      ~ allow_squash_merge          = false -> true
      ~ allow_update_branch         = false -> true
      ~ delete_branch_on_merge      = false -> true
        id                          = "tqer39"
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
        name                        = "tqer39"
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      ~ topics                      = [
          - "managed-by-terraform-github",
            # (1 unchanged element hidden)
        ]
      ~ vulnerability_alerts        = false -> true
        # (24 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 4 to add, 7 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform-github","PRNumber":1206,"Program":"tfcmt","SHA1":"d9c1ee190048864b67ba05c8b739556f44f1b806","Target":"repository","Vars":{},"WorkflowName":"Terraform - GitHub"} -->